In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [3]:
np.random.seed(101)

In [5]:
randn(5,4)

array([[ 0.98877285,  0.51383273, -0.92820483,  0.8469039 ],
       [-0.29843574,  0.02914148,  0.88903088, -1.83926086],
       [ 0.8635956 , -1.0765905 , -0.58038298,  1.20902728],
       [ 1.20174403, -0.82046316, -1.02957716, -1.52485554],
       [-0.8548599 ,  1.60281554,  0.18547899, -0.99401829]])

In [6]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

df

          W         X         Y         Z
A -0.131906 -1.335092 -0.089298  0.698566
B -1.409126  0.870907  1.585812  0.929658
C -0.550876  0.942045 -0.975349 -1.054851
D  2.165421 -1.267240 -0.802843 -0.253479
E  0.090699  1.321715  0.794129  1.359712

In [8]:
# Indexing - seeing columns

df['W'] # Returns a series

A   -0.131906
B   -1.409126
C   -0.550876
D    2.165421
E    0.090699
Name: W, dtype: float64

In [10]:
df.W #do not use it

A   -0.131906
B   -1.409126
C   -0.550876
D    2.165421
E    0.090699
Name: W, dtype: float64

In [11]:
# Getting list of coloumns

df[['W','Z']]

          W         Z
A -0.131906  0.698566
B -1.409126  0.929658
C -0.550876 -1.054851
D  2.165421 -0.253479
E  0.090699  1.359712

In [12]:
# Creating a new column

df["new"] = df["W"] + df["Y"]

In [13]:
df

          W         X         Y         Z       new
A -0.131906 -1.335092 -0.089298  0.698566 -0.221205
B -1.409126  0.870907  1.585812  0.929658  0.176687
C -0.550876  0.942045 -0.975349 -1.054851 -1.526225
D  2.165421 -1.267240 -0.802843 -0.253479  1.362578
E  0.090699  1.321715  0.794129  1.359712  0.884827

In [16]:
# Removing columns

df.drop('new', axis =1) #axis = 1 means column, also it doesnot happen inplace

          W         X         Y         Z
A -0.131906 -1.335092 -0.089298  0.698566
B -1.409126  0.870907  1.585812  0.929658
C -0.550876  0.942045 -0.975349 -1.054851
D  2.165421 -1.267240 -0.802843 -0.253479
E  0.090699  1.321715  0.794129  1.359712

In [19]:
df.drop('new', axis = 1, inplace = True) # For impact to be permanent use inplace

In [20]:
df

          W         X         Y         Z
A -0.131906 -1.335092 -0.089298  0.698566
B -1.409126  0.870907  1.585812  0.929658
C -0.550876  0.942045 -0.975349 -1.054851
D  2.165421 -1.267240 -0.802843 -0.253479
E  0.090699  1.321715  0.794129  1.359712

In [21]:
# Dropping rows

df.drop('E', axis = 0)

          W         X         Y         Z
A -0.131906 -1.335092 -0.089298  0.698566
B -1.409126  0.870907  1.585812  0.929658
C -0.550876  0.942045 -0.975349 -1.054851
D  2.165421 -1.267240 -0.802843 -0.253479

In [22]:
# Getting the shape

df.shape

(5, 4)

In [26]:
# Selecting rows

df.loc["C"] #.loc takes labels

W   -0.550876
X    0.942045
Y   -0.975349
Z   -1.054851
Name: C, dtype: float64

In [27]:
df.iloc[2] # .iloc takes numerical/integer based indexing

W   -0.550876
X    0.942045
Y   -0.975349
Z   -1.054851
Name: C, dtype: float64

In [29]:
# Selecting subsets of rows and columns

df.loc['B','Y'] # Value at row B column Y

1.58581239401606

In [30]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.131906 -0.089298
B -1.409126  1.585812

In [32]:
# Conditionals

df > 0 # Returns dataframe with true and false

       W      X      Y      Z
A  False  False  False   True
B  False   True   True   True
C  False   True  False  False
D   True  False  False  False
E   True   True   True   True

In [36]:
# Return dataframe with condition

df[df > 0]

          W         X         Y         Z
A       NaN       NaN       NaN  0.698566
B       NaN  0.870907  1.585812  0.929658
C       NaN  0.942045       NaN       NaN
D  2.165421       NaN       NaN       NaN
E  0.090699  1.321715  0.794129  1.359712

In [39]:
# conditional selection in columns

df["W"] > 0 # Return as series

A    False
B    False
C    False
D     True
E     True
Name: W, dtype: bool

In [42]:
df[df["W"] > 0]

          W         X         Y         Z
D  2.165421 -1.267240 -0.802843 -0.253479
E  0.090699  1.321715  0.794129  1.359712

In [43]:
# Grab all the rows where Z is less than 0

df[df["Z"] < 0]

          W         X         Y         Z
C -0.550876  0.942045 -0.975349 -1.054851
D  2.165421 -1.267240 -0.802843 -0.253479

In [46]:

resultdf = df[df["W"] > 0]

resultdf["Z"]

D   -0.253479
E    1.359712
Name: Z, dtype: float64

In [49]:
# The above thing can be done in a single line as

df[df["W"] > 0][["Z", "Y"]]

          Z         Y
D -0.253479 -0.802843
E  1.359712  0.794129

In [52]:
# using multiple conditions - do not use "and", its "&"

df[(df["W"] > 0) & (df["Z"] > 1)]

          W         X         Y         Z
E  0.090699  1.321715  0.794129  1.359712

In [54]:
df[(df["W"] > 0) | (df["Z"] > 1)] # OR operator

          W         X         Y         Z
D  2.165421 -1.267240 -0.802843 -0.253479
E  0.090699  1.321715  0.794129  1.359712

In [57]:
# Resetting index and seeting it back

df.reset_index() #index resets to a column, doesnot happen inplace for that mention inplace = True

  index         W         X         Y         Z
0     A -0.131906 -1.335092 -0.089298  0.698566
1     B -1.409126  0.870907  1.585812  0.929658
2     C -0.550876  0.942045 -0.975349 -1.054851
3     D  2.165421 -1.267240 -0.802843 -0.253479
4     E  0.090699  1.321715  0.794129  1.359712

In [58]:
newindex = 'CA NY WY OR CO'.split()

In [60]:
newindex

['CA', 'NY', 'WY', 'OR', 'CO']

In [62]:
df["States"] = newindex

In [63]:
df

          W         X         Y         Z States
A -0.131906 -1.335092 -0.089298  0.698566     CA
B -1.409126  0.870907  1.585812  0.929658     NY
C -0.550876  0.942045 -0.975349 -1.054851     WY
D  2.165421 -1.267240 -0.802843 -0.253479     OR
E  0.090699  1.321715  0.794129  1.359712     CO

In [66]:
# I want to make the States column as the index

df.set_index('States') #isnt inplace, need to do it explicitly

               W         X         Y         Z
States
CA     -0.131906 -1.335092 -0.089298  0.698566
NY     -1.409126  0.870907  1.585812  0.929658
WY     -0.550876  0.942045 -0.975349 -1.054851
OR      2.165421 -1.267240 -0.802843 -0.253479
CO      0.090699  1.321715  0.794129  1.359712

In [67]:
df

          W         X         Y         Z States
A -0.131906 -1.335092 -0.089298  0.698566     CA
B -1.409126  0.870907  1.585812  0.929658     NY
C -0.550876  0.942045 -0.975349 -1.054851     WY
D  2.165421 -1.267240 -0.802843 -0.253479     OR
E  0.090699  1.321715  0.794129  1.359712     CO

In [70]:
# Multi level indexing

# Index level

outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))

hier_index = pd.MultiIndex.from_tuples(hier_index)

In [72]:
# The data frame has an index hierarchy here

df = pd.DataFrame(randn(6,2), hier_index, ["A","B"])
df

             A         B
G1 1  0.771970  0.294217
   2 -1.391519  0.147486
   3 -0.729466 -0.720110
G2 1 -0.285257  2.090539
   2  1.004056  1.031916
   3 -1.081118 -0.000355

In [74]:
# Grabbing everything under outside

df.loc['G1']

          A         B
1  0.771970  0.294217
2 -1.391519  0.147486
3 -0.729466 -0.720110

In [75]:

df.loc["G1"].loc[1]

A    0.771970
B    0.294217
Name: 1, dtype: float64

In [77]:
# seeing index names

df.index.names = ["Groups", "Numbers"]

In [78]:
df

                       A         B
Groups Numbers
G1     1        0.771970  0.294217
       2       -1.391519  0.147486
       3       -0.729466 -0.720110
G2     1       -0.285257  2.090539
       2        1.004056  1.031916
       3       -1.081118 -0.000355

In [86]:
# we want the value 1.031916 ie value in column B under G2 row 2

df.loc["G2"].loc[2]["B"]

1.0319158600110228

In [88]:
# Cross section of rows and columns

df.loc["G1"]

                A         B
Numbers
1        0.771970  0.294217
2       -1.391519  0.147486
3       -0.729466 -0.720110

In [95]:
# Suppose I want row 1 for both G1 and G2, this type of indexing is difficult with .loc but its easy with xs function

df.xs(1, level = "Numbers")

               A         B
Groups
G1      0.771970  0.294217
G2     -0.285257  2.090539